/*温馨提示*/  
function wy_ts(){
  $(".tscon").html("<h1>温馨提示：</h1><p>银行卡支付说明：</p><p>1、您必须开通了网上银行业务；</p><p>2、网上银行开通办法请咨询当地所属银行；</p><p>3、请您关闭所有屏蔽弹出窗口之类的功能，否则在线支付将无法继续，比如：3721、上网助手、google toolbar、alexa toolbar、baidu等；</p><p>4、如果您用信用卡支付，请确认该信用卡的网上交易限额大于等于您的充值金额；</p><p>5、请充值时务必确认好您的充值金额准确无误后再进行充值，避免输错金额导致的失误，如因未仔细确认金额造成的充值问题，我们将一律不予处理此类退款申诉。</p>");
  }
function zfb_ts(){
  $(".tscon").html("<h1>温馨提示：</h1><p>支付宝说明：</p><p>1、支付宝余额支付：只要您的支付宝账户中存有余额，就可以为游戏进行充值。</p><p>2、银行卡支付：只要您拥有与支付宝公司合作银行中的任意一张银行卡，并开通“网上银行”服务，即可完成充值。</p><p>3、如果您用信用卡支付，请确认该信用卡的网上交易限额大于等于您的充值金额；</p>");
  }
function szx_ts(){
  $(".tscon").html("<h1>温馨提示：</h1><p>神州行(易宝)充值卡说明：</p><p>1、请确认您的充值卡是序列号17位、密码18位，由中国移动发行的全国通用的神州行充值卡，而且是没有使用过的。</p><p>2、请务必使用与您选择的面额相同的神州行卡进行支付，如果选择金额额度不正确会导致卡面金额丢失。</p><p>3、本充值方式还支持江苏、浙江、广东、辽宁、福建的神州行地方卡。支持300和500元面额。</p><p>4、如果有疑问，请联系我们在线客服或拨打客服电话。</p>")}
function junw_ts(){
  $(".tscon").html("<h1>温馨提示：</h1><p>骏卡充值说明：</p><p>1、请确认您的骏卡充值卡是由“北京汇元网科技有限责任公司”发行的充值卡。</p><p>2、请按卡面金额进行充值，如填写额度不正确可能会无法完成充值。</p><p>3、不能使用特定游戏专属充值卡支付。</p><p><font color=\"#d70000\">4、骏卡充值有手续费，手续费为16%。【该手续费为发卡单位收取】</font></p><p>5、如果有疑问，请拨打骏卡客服电话：010－58103559。</p>")}
function liant_ts(){
  $(".tscon").html("<h1>温馨提示：</h1><p>联通卡充值说明：</p><p>1、支持中国联通发行的联通一卡充支付，面值为20元、30元、50元、100元、300元、500元</p><p><font color=\"#d70000\">2、联通卡充值有手续费，手续费为6%。【该手续费为发卡单位收取】</font></p><p>3、如果有疑问，请联系我们在线客服或拨打客服电话。</p>")}
function shengd_ts(){
  $(".tscon").html("<h1>温馨提示：</h1><p>盛大游戏卡充值说明：</p><p>1、请使用卡号以CSC5、CS、S、CA、CSB、YC、YD、YA、YB、801335开头的“盛大互动娱乐卡”进行支付，暂不支持SC开头的卡。</p><p>2、盛大游戏卡支持面值：5元、10元、30元、35元、45元、100元、350元、1000元。</p><p><font color=\"#d70000\">3、盛大游戏卡充值有手续费，手续费为16%。【该手续费为发卡单位收取】</font></p><p>4.如果有疑问，请联系我们在线客服或拨打客服电话。</p>")}
function wanm_ts(){
  $(".tscon").html("<h1>温馨提示：</h1><p>完美卡充值说明：</p><p>1、完美一卡通是指能为完美时空所属所有的网络产品充值的卡种，卡号10位，卡密15位。</p><p>2、完美卡可以进行多次在线支付，直至卡内余额为零。</p><p>3、完美卡支持的面额有：15元，30元，50元，100元。</p><p><font color=\"#d70000\">4、完美卡充值有手续费，手续费为19%。【该手续费为发卡单位收取】</font></p><p>5、如果有疑问，请联系我们在线客服或拨打客服电话。</p>")}
function zhent_ts(){
  $(".tscon").html("<h1>温馨提示：</h1><p>征途卡充值说明：</p><p>1、支持全国官方征途游戏充值卡，卡号16位，密码8位。</p><p>2、征途游戏卡支持面值：10元、15元、20元、25元、30元、50元，60元、100元、300元、468元。</p><p>3、<font color=\"#d70000\">征途卡充值有手续费，手续费为16%。【该手续费为发卡单位收取】</font></p><p>4、如果有疑问，请联系我们在线客服或拨打客服电话。</p>")}
function paypal_ts(){
  $(".tscon").html("<h1>温馨提示：</h1><p>Paypal说明：</p><p>1、电子支票从付款人的账户中结清资金后（通常需要3-5个工作日）才算转账成功。</p><p>2、转账Paypal手续费由转账人承担。比例是：4%+0.3USD / 笔 如：转账100美金，paypal手续费是100×4%+0.3USD / 笔，手续费是4.3美金。实际到账金额是：95.7美金。</p><p>3、建议使用的币种选择为美金，以减少汇率损失。</p><p>4、为了保障paypal账户的安全性，请使用paypal转账充值的玩家提供身份证、驾照或护照其中一样扫描证件给充值客服核对，以便查询处理。此信息为官方核对paypal转账之用，不会外泄。</p>")}
function ptb_ts(){
  $(".tscon").html("<h1>温馨提示：</h1><p>平台币充游戏说明：</p><p>1、平台币可以通过其他充值渠道获取。</p><p>2、平台币充游戏可以充1-50000任意金额。</p><p>3、平台币充游戏更为快捷。</p>")}

 /*选择银行*/
function selectbank(bankcode) {
  $("input[value='"+bankcode+"']").attr('checked', true);
}

/*替换非数字字符串*/
function ylsu(o){
 o.value=o.value.replace(/[^\d]/g,'');
 var moneysr = $("#money").val();
  if(moneysr<=0){
     $("#tishi").html('您输入的金额不能小于1');
  }
}

$(document).ready(function(){
  $("#money").focus(function(){
    $("#tishi").html('请输入整数充值金额');
  });
});